#include <stdio.h>
void work() {
    int a, b, c; // a为原税款，b为新税款，c为收入
    scanf("%d", &a);
    if (a == 0) { // 原来的税款是0时不能确定在新的税法下是否需要缴税。因此无法唯一确定新的税款，直接输出-1
        printf("-1\n");
        return;
    } else if (a <= 200) { // 原税款在101-200间对应的收入区间是2001-4000，税率为5%
        c = a * 20;
    } else if (a <= 800) { // 原税款在401-800间对应的收入区间是4001-8000，税率为10%
        c = a * 10;
    } else if (a <= 2250) { // 原税款在1203-2250间对应的收入区间是8001-15000，税率为15%
        c = a * 20 / 3;
    } else { // 原税款在3301及以上对应的收入区间是15001及以上，税率为20%
        c = a * 5;
    }
    if (c <= 2500) { // 根据算出来的收入算出新税法下的税款
        b = c / 10;
    } else if (c <= 5000) {
        b = c / 20 * 3;
    } else if (c <= 9000) {
        b = c / 5;
    } else {
        b = c / 4;
    }
    printf("%d\n", b); // 输出新税款
    return;
}
int main() {
    int T = 1;
    scanf("%d", &T);
    while (T--)
        work();
    return 0;
}